RubenKelevra/espressif_esp32-camera/target/esp32s3/ll_cam.c
static void IRAM_ATTR ll_cam_reset_dma_descriptors(lldesc_t *dma, uint32_t count)
{
    for (uint32_t i = 0; i < count; i++) {
        dma[i].length = 0;
        dma[i].sosf = 0;
        dma[i].eof = 0;
        dma[i].owner = 1;
    }
}

bool ll_cam_start(cam_obj_t *cam, int frame_pos)
{
    LCD_CAM.cam_ctrl1.cam_start = 0;

    if (cam->jpeg_mode || !cam->psram_mode) {
        GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
        GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 1;
    }

    LCD_CAM.cam_ctrl1.cam_reset = 1;
    LCD_CAM.cam_ctrl1.cam_reset = 0;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 1;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 0;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 1;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 0;

    if (cam->jpeg_mode && cam->psram_mode) {
        LCD_CAM.cam_ctrl.cam_vs_eof_en = 1;
    } else {
        LCD_CAM.cam_ctrl.cam_vs_eof_en = 0;
        LCD_CAM.cam_ctrl1.cam_rec_data_bytelen = cam->dma_half_buffer_size - 1; // Ping pong operation
    }

    if (!cam->psram_mode) {
        ll_cam_reset_dma_descriptors(cam->dma, cam->dma_node_cnt);
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->dma[0]) & 0xfffff;
    } else {
        ll_cam_reset_dma_descriptors(cam->frames[frame_pos].dma, cam->dma_node_cnt);
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->frames[frame_pos].dma[0]) & 0xfffff;
    }

    GDMA.channel[cam->dma_num].in.link.start = 1;

    LCD_CAM.cam_ctrl.cam_update = 1;
    LCD_CAM.cam_ctrl1.cam_start = 1;
    return true;
}

esp_err_t ll_cam_deinit(cam_obj_t *cam)
{
    if (cam->cam_intr_handle) {
        esp_intr_free(cam->cam_intr_handle);
        cam->cam_intr_handle = NULL;
    }

    if (cam->dma_intr_handle) {
        esp_intr_free(cam->dma_intr_handle);
        cam->dma_intr_handle = NULL;
    }
    if (cam->dma_channel_handle) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
        gdma_disconnect(cam->dma_channel_handle);
#endif
        gdma_del_channel(cam->dma_channel_handle);
        cam->dma_channel_handle = NULL;
        // GDMA.channel[cam->dma_num].in.link.addr = 0x0;
    }
    LCD_CAM.cam_ctrl1.cam_start = 0;
    LCD_CAM.cam_ctrl1.cam_reset = 1;
    LCD_CAM.cam_ctrl1.cam_reset = 0;
    return ESP_OK;
}

static esp_err_t ll_cam_dma_init(cam_obj_t *cam)
{
    //alloc rx gdma channel
#if (ESP_IDF_VERSION_MAJOR < 6)
    gdma_channel_alloc_config_t rx_alloc_config = {
        .direction = GDMA_CHANNEL_DIRECTION_RX,
    };
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
    esp_err_t ret = gdma_new_ahb_channel(&rx_alloc_config, &cam->dma_channel_handle);
#else
    esp_err_t ret = gdma_new_channel(&rx_alloc_config, &cam->dma_channel_handle);
#endif
#else
    gdma_channel_alloc_config_t rx_alloc_config = {0};
    esp_err_t ret = gdma_new_ahb_channel(&rx_alloc_config, NULL, &cam->dma_channel_handle);
#endif
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't find available GDMA channel");
        return ESP_FAIL;
    }
    int chan_id = -1;
    ret = gdma_get_channel_id(cam->dma_channel_handle, &chan_id);
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't get GDMA channel number");
        return ESP_FAIL;
    }
    cam->dma_num = chan_id;
    ESP_LOGI(TAG, "DMA Channel=%d", cam->dma_num);

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    ret = gdma_connect(cam->dma_channel_handle, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_CAM, 0));
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't connect GDMA channel to camera peripheral");
        return ESP_FAIL;
    }

    gdma_strategy_config_t strategy_config = {
        .owner_check = true,
        .auto_update_desc = false,
    };
    ret = gdma_apply_strategy(cam->dma_channel_handle, &strategy_config);
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't apply GDMA strategy");
        return ESP_FAIL;
    }
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    gdma_transfer_config_t transfer_config = {
        .max_data_burst_size = 32,
        .access_ext_mem = true,
    };
    ret = gdma_config_transfer(cam->dma_channel_handle, &transfer_config);
    if (ret != ESP_OK) {
        cam_deinit();
        ESP_LOGE(TAG, "Can't configure GDMA transfer ability");
        return ESP_FAIL;
    }
#endif
    // for (int x = (SOC_GDMA_PAIRS_PER_GROUP - 1); x >= 0; x--) {
    //     if (GDMA.channel[x].in.link.addr == 0x0) {
    //         cam->dma_num = x;
    //         ESP_LOGI(TAG, "DMA Channel=%d", cam->dma_num);
    //         break;
    //     }
    //     if (x == 0) {
    //         cam_deinit();
    //         ESP_LOGE(TAG, "Can't found available GDMA channel");
	// 		return ESP_FAIL;
    //     }
    // }

#if ESP_IDF_VERSION_MAJOR > 5
    if (!(DPORT_REG_GET_BIT(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST) == 0 &&
          DPORT_REG_GET_BIT(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN) != 0)) {
        DPORT_CLEAR_PERI_REG_MASK(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN);
        DPORT_SET_PERI_REG_MASK(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST);
        DPORT_SET_PERI_REG_MASK(SYSTEM_PERIP_CLK_EN1_REG, SYSTEM_DMA_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_DMA_RST);
    }
#else
    if (!periph_ll_periph_enabled(PERIPH_GDMA_MODULE)) {
        periph_ll_disable_clk_set_rst(PERIPH_GDMA_MODULE);
        periph_ll_enable_clk_clear_rst(PERIPH_GDMA_MODULE);
    }
#endif
    ll_cam_dma_reset(cam);
    return ESP_OK;
}

#if CONFIG_CAMERA_CONVERTER_ENABLED
static esp_err_t ll_cam_converter_config(cam_obj_t *cam, const camera_config_t *config)
{
    if (config->pixel_format == PIXFORMAT_JPEG || config->conv_mode == CONV_DISABLE) {
        LCD_CAM.cam_rgb_yuv.val = 0;
        cam->conv_mode = CONV_DISABLE;
        return ESP_OK;
    }

    esp_err_t ret = ESP_OK;

    switch (config->conv_mode) {
    case YUV422_TO_YUV420:
        if (config->pixel_format != PIXFORMAT_YUV422) {
            ret = ESP_FAIL;
        } else {
            ESP_LOGI(TAG, "YUV422 to YUV420 mode");
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv2yuv_mode = 1;
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv_mode = 0;
            LCD_CAM.cam_rgb_yuv.cam_conv_trans_mode = 1;
        }
        break;
    case YUV422_TO_RGB565:
        if (config->pixel_format != PIXFORMAT_YUV422) {
            ret = ESP_FAIL;
        } else {
            ESP_LOGI(TAG, "YUV422 to RGB565 mode");
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv2yuv_mode = 3;
            LCD_CAM.cam_rgb_yuv.cam_conv_yuv_mode = 0;
            LCD_CAM.cam_rgb_yuv.cam_conv_trans_mode = 0;
        }
        break;
    default:
        ret = ESP_ERR_NOT_SUPPORTED;
        break;
    }
#if CONFIG_LCD_CAM_CONV_BT709_ENABLED
    LCD_CAM.cam_rgb_yuv.cam_conv_protocol_mode = 1;
#else
    LCD_CAM.cam_rgb_yuv.cam_conv_protocol_mode = 0;
#endif
#if CONFIG_LCD_CAM_CONV_FULL_RANGE_ENABLED
    LCD_CAM.cam_rgb_yuv.cam_conv_data_out_mode = 1;
    LCD_CAM.cam_rgb_yuv.cam_conv_data_in_mode = 1;
#else
    LCD_CAM.cam_rgb_yuv.cam_conv_data_out_mode = 0;
    LCD_CAM.cam_rgb_yuv.cam_conv_data_in_mode = 0;
#endif
    if (ret != ESP_OK) {
        LCD_CAM.cam_rgb_yuv.val = 0;
        cam->conv_mode = CONV_DISABLE;
        return ret;
    }

    LCD_CAM.cam_rgb_yuv.cam_conv_mode_8bits_on = 1;
    LCD_CAM.cam_rgb_yuv.cam_conv_bypass = 1;
    cam->conv_mode = config->conv_mode;
    return ESP_OK;
}
#endif

